[{"title":"Maus zum Käse","rating":0,"description":"Programmiere die Maus so, dass sie über die Brücke zum Käse läuft und dabei nicht ins Wasser fällt.","filename":"MausZumKaese.cubi","solution_exists":true},{"title":"Aquarium","rating":0,"description":"Die Fische bewegen sich von Rand zu Rand. Der Seestern kann mit den Pfeiltasten bewegt werden und fällt bei einer Berührung mit einem Fisch zu Boden.","filename":"Aquarium.cubi","solution_exists":true},{"title":"Bananen hergezaubert","rating":0,"description":"Der Zauberer zaubert bei Anklicken Bananen herbei. Dieses Projekt bietet eine Möglichkeit Zufall und Botschaften (in diesem Fall als \"Zauber\") anschaulich zu machen.","filename":"BananenHergezaubert.cubi","solution_exists":true},{"title":"Wettrennen","rating":0,"description":"Zwei Figuren laufen gesteuert durch schnelle Tastendrücke um die Wette. Sehr gut zum Einstieg in die Spieleentwicklung.","filename":"Wettrennen.cubi","solution_exists":true},{"title":"Labyrinth","rating":0,"description":"Programmiere die Maus so, dass sie durch das Labyrinth den Weg zuerst zum Schlüssel und dann zum Tor findet.","filename":"Labyrinth.cubi","solution_exists":true},{"title":"Buchstaben","rating":0,"description":"Programmiere jeden Buchstaben eines Worts (z.B. \"Scratch\") so, dass dieser aus einer gewählten Ecke zu seiner richtigen Position im Wort gleitet.","filename":"Buchstaben.cubi","solution_exists":true},{"title":"Farben","rating":0,"description":"\"Programmiere die Maus so, dass sie eine geometrische Figur abhängig von ihrer Hintergrundfarbe zeichnet, wenn sie angeklickt wird.","filename":"Farben.cubi","solution_exists":true},{"title":"Trampolin","rating":0,"description":"In diesem Programm springt Scratch (die Katze) auf einem Trampolin und kann in der Luft Drehungen und Salti ausführen. Durch Gedrückthalten der Leertaste springt Scratch höher.","filename":"Trampolin.cubi","solution_exists":true},{"title":"Zeichnen","rating":0,"description":"Erlernen der Programmierung von Bewegungsmustern und des Zeichnens. Ist als eines der ersten Aufgaben mit Scratch gut geeignet.","filename":"Zeichnen.cubi","solution_exists":true},{"title":"Pacman","rating":0,"description":"Dieses Projekt ist deutlich fortgeschrittener. Es geht um die Programmierung des bekannten Spiels \"Pacman\". Die Schüler/-innen lernen alle Aspekte der Spiele-programmierung kennen.","filename":"Pacman.cubi","solution_exists":true},{"title":"Finde das Tier","rating":0,"description":"Nachdem die Katze einen Namen genannt hat, muss der Spieler innerhalb von einer Sekunde auf das richtige Tier klicken. Mit fünf Punkten ist das Spiel gewonnen, bei -5 verloren.","filename":"FindeDasTier.cubi","solution_exists":true},{"title":"Fang mich","rating":0,"description":"Die Katze und der Käfer jagen einander. Der Käfer ist computer-, die Katze spielergesteuert. Die Schüler erlernen den Umgang mit einer Stoppuhr, Tastatur-eingaben und Nachrichten.","filename":"FangMich.cubi","solution_exists":true},{"title":"Standard","rating":0,"description":"Ein leeres Projekt zum Starten.","filename":"Standard.cubi","solution_exists":true}]